Revit 2027 API
ElementLevelFilter Properties
The ElementLevelFilter type exposes the following members.
Properties
Name | Description
Inverted |  True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
(Inherited from ElementFilter)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ElementFilter)
LevelId |  The id of the level that will be matched to elements' associated level.
Top
See Also
Reference
ElementLevelFilter Class
Autodesk.Revit.DB Namespace